app/views/posts/show.html.erb


    $('button#comment1').click(function(e){
        e.preventDefault();
        var commenter = document.getElementById('Username').value
        var body = document.getElementById('comment').value
        document.getElementById('Username').value = ""
        document.getElementById('comment').value = ""

        var ajax_path = <%= @post.id%>+"/comments"
        $.ajax({
            type: "POST",
            url: ajax_path,

            dataType: "script",
            data:{
                comment:{
                    "commenter": commenter,
                    "body":body
                }

            }

---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]