app/controllers/comments_controller.rb

	def create
	    @post = Post.find(params[:post_id])
	    @comment = @post.comments.create(comment_params)
	    @comments = @post.comments.order("created_at DESC")
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", ""], ["body", ""], ["post_id", 1], ["created_at", "2018-01-19 10:31:42.600611"], ["updated_at", "2018-01-19 10:31:42.600611"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? ORDER BY created_at DESC  [["post_id", 1]]