app/controllers/lists_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "lists" ("name", "aboutText", "photolink", "link", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create

        @post = Post.find(params[:post_id])
        @list = @post.lists.create(list_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."post_id" = ? AND "lists"."id" = ? LIMIT ?  [["post_id", 1], ["id", 1], ["LIMIT", 1]]
---
      def show

        @post = Post.find(params[:post_id])
        @list = @post.lists.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."post_id" = ? AND "lists"."id" = ? LIMIT ?  [["post_id", 1], ["id", 8], ["LIMIT", 1]]
UPDATE "lists" SET "downvotes" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["downvotes", 4], ["updated_at", "2018-01-19 04:39:46.864024"], ["id", 7]]
---
      def upvote
        @post = Post.find(params[:post_id])
        @list = @post.lists.find(params[:list_id])

        protip = String(@post.id) + "_up_" +String(@list.id)

        if !browser.bot? && browser.known?
          recently_viewed = cookies[:viewd_protips].to_s.split(':')
          if !recently_viewed.include?(protip)
            k = @list.upvotes
            @list.upvotes = k+1
            @list.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."post_id" = ? AND "lists"."id" = ? LIMIT ?  [["post_id", 1], ["id", 8], ["LIMIT", 1]]
UPDATE "lists" SET "downvotes" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["downvotes", 1], ["updated_at", "2018-01-11 07:16:03.657962"], ["id", 8]]
---
      def downvote
        @post = Post.find(params[:post_id])

        @list = @post.lists.find(params[:list_id])

        protip = String(@post.id) + "_down_" +String(@list.id)

        if !browser.bot? && browser.known?
          recently_viewed = cookies[:viewd_downvotes].to_s.split(':')
          if !recently_viewed.include?(protip)
            k = @list.downvotes
            @list.downvotes = k+1
            @list.save