app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."post_id" = ? ORDER BY "lists"."upvotes" DESC, "lists"."downvotes" ASC LIMIT ?  [["post_id", 1], ["LIMIT", 5]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? ORDER BY created_at DESC  [["post_id", 1]]
---
    def show
      @post = Post.find(params[:id])
      if params[:value]
        @list1 = @post.lists.order({:upvotes => :desc},:downvotes).limit(params[:value])
      else
        @list1 = @post.lists.order({:upvotes => :desc},:downvotes).limit(3)
      end

      @comments = @post.comments.order("created_at DESC")

INSERT INTO "posts" ("postText", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["postText", "Best cricketers of the year 2017"], ["category", "Sport"], ["created_at", "2017-12-23 20:03:41.477061"], ["updated_at", "2017-12-23 20:03:41.477061"]]
---
    def create
        @post = Post.new(post_params)
        @post.save